Repository: 84000/data-translation-memory
Catalog: toh738_84000-in-praise-of-the-glorious-goddess-sarasvati.tmx
Source language: bo
Languages: en

source: ༄༅། །དཔལ་ལྷ་མོ་སྒྲ་དབྱངས་ལ་བསྟོད་པ།
en: In Praise of the Glorious Goddess Sarasvatī

source: ལམ་གང་གིས་ན་སངས་རྒྱས་འབྱུང་བ་དང་། །རྒྱལ་བ་སྲས་བཅས་ཆོས་ཀྱི་བླ་མར་གྱུར།
en: In the path that leads to awakening, The victors and their heirs, masters of the Dharma,

source: །མཁྱེན་པའི་རིམ་པར་ས་རྣམས་བཀོད་པ་ཡི།
en: And the multitudes of wisdom maṇḍalas

source: །ཤེས་རབ་དཀྱིལ་འཁོར་མང་ལ་སྐྱབས་སུ་མཆི།
en: Arranged in successive levels of knowing—in these we seek refuge.

source: །ཕྱག་འཚལ་དཔལ་ལྡན་ལྷ་མོ་དབྱངས་ཅན་མ།
en: Homage to you, glorious goddess Sarasvatī.

source: །འཇིག་རྟེན་ཁམས་འདིར་སྨྲ་ལ་དབང་བརྙེས་ཤེས།
en: Your mastery over speech is renowned throughout the world

source: །དྲང་སྲོང་རིག་གསུམ་རིག་པའི་ཕ་རོལ་གཤེགས།
en: And you have transcended the three knowledges of the sages.

source: །དེ་ནི་སྤྱོད་པ་རྒྱ་ཆེན་རྣམས་ལས་བྱུང་།
en: All of this is the result of your vast conduct.

source: །སེམས་ཅན་དོན་ཕྱིར་ཕྲིན་ལས་ཆེན་པོའི་ཁུར།
en: You take up the burden of immense activities

source: །སྤྲོ་བར་དཀའ་བ་ཀུན་ཀྱང་ཁྱོད་ཀྱིས་མཛད།
en: And joyfully endure every hardship for the benefit of beings.

source: །ས་དང་ཕ་རོལ་ཕྱིན་པ་བཅུ་སྤྱད་པས།
en: Coursing through the levels and the ten perfections,

source: །དགེ་བའི་ཚོགས་བརྟན་ཡིད་བཞིན་ལུས་སུ་བསྒྱུར།
en: And standing steadfast in stores of virtue, you take whatever form is needed.

source: །ཞལ་གྱི་དཀྱིལ་འཁོར་ཟླ་བ་དྲི་མེད་རྒྱས།
en: Your rounded face is the flawless moon in full.

source: །ཐུགས་རྗེའི་སྤྱན་གསལ་འགྲོ་བའི་མིག་འབྱེད་པ།
en: Your lustrous eyes of compassion open the eyes of others

source: །དུས་རིང་འཇིག་རྟེན་ཀུན་ལ་བདེ་བར་གཟིགས།
en: As you gaze at length upon every last universe, effortlessly.

source: །དེ་ལ་ལྷ་དབང་ཚངས་ཚོགས་ཤིན་ཏུ་འདུད།
en: It is before you that the likes of Devendra and Brahmā bow down.

source: །བྱམས་ཤིང་བཟོད་ལྡན་སྙིང་རྗེ་སྐྱེད་པའི་མ།
en: Compassionate mother, replete with love and patience,

source: །ལྷ་མོ་མཆོག་སྟེ་འགྲོ་ཀུན་སྐྱོང་བར་དགྱེས།
en: It is your delight, noble goddess, to nurture every single being.

source: །ཐོར་ཚུགས་རི་བོ་རྩེ་འདྲ་སྤོབས་པ་འཕགས།
en: Your eloquence is lofty and your top-knot rivals mountain peaks.

source: །ཤེས་རབ་ཟབ་ཅིང་ཤེས་པའི་རྟེན་བྱེད་ཀྱང་།
en: Your wisdom runs deep as you act in support of knowledge.

source: །རིག་པའི་གནས་ལ་མངའ་བརྙེས་ཚིག་གི་བདག །འཇིག་རྟེན་ན་ཡང་ལྷ་ཡི་ལྷར་གྱུར་ལ།
en: Wielding mastery over fields of knowledge, you are the patroness of words. As you are the god of all gods in the universe,

source: །སྡུག་བསྔལ་བསལ་བར་རབ་བརྩོན་གཉེན་མཆོག་པས།
en: And a supreme companion who endeavors to dispel our suffering,

source: །མུ་སུ་རྟོག་གེ་པ་རྣམས་ཀུན་ཀྱང་འདུད།
en: Even extremist scholars bow down before you.

source: །ཡན་ལག་རྣམ་པར་འབྱེས་ཤིང་གསུང་སྙན་པ།
en: Your limbs are well proportioned, and your voice is ever sweet.

source: །ཡོན་ཏན་དྲི་མེད་བསོད་ནམས་འབར་བར་བསྒྱིངས།
en: Poised with majesty, you glow with flawless qualities and merit.

source: །རིག་པ་མཆོག་གི་དངོས་གྲུབ་སྦྱིན་མཛད་པ།
en: As it is you who grants the accomplishments of the highest knowledge,

source: །བློ་མྱུར་ཚིག་འཆང་སྤོབས་པའི་མཆོག་སྩོལ་ཅིག །སེམས་ཅན་ཀུན་ལ་རྟག་ཏུ་ཕན་སེམས་པ།
en: Grant us swift intellect, retention of words, and eloquence most supreme! With the welfare of every being always in your heart,

source: །མི་སླུ་མཆོག་ཁྱོད་རྣམ་གྲོལ་ས་ལ་བཞུགས།
en: Eminent and unfailing goddess, you dwell in liberation.

source: །ཐུགས་དམ་བརྟན་བཅས་བསྐུལ་པ་རྣམས་ལ་ཡང་།
en: Firm in your promises, you consider with grace Those who call upon you, and you fulfill their every wish.

source: །དཔལ་གྱིས་དགོངས་ཤིང་དོན་ཀུན་ཉེ་བར་སྐོངས།
en: As the master of sound, you capture in words

source: །འདི་ལྟར་འཇིག་རྟེན་དག་ན་སྣང་བ་ཀུན། །སྒྲ་འཇོམས་ཁྱད་པར་ཚིག་གིས་དོན་མཚོན་ཏེ།
en: Everything that appears in the universe.

source: །ཕན་ཚུན་ཤེས་ཤིང་ཡང་དག་བརྡ་སྤྲོད་པའང་།
en: You are understood by all and skilled in expression.

source: །དབྱངས་ཅན་ཁྱོད་ཀྱི་མཐུ་སྟེ་བསམ་མི་ཁྱབ།
en: O Sarasvatī, your capabilities are inconceivable.

source: །གཟུངས་དང་ཆོས་ཀྱི་སྟོབས་ལ་དབང་བརྙེས་པ།
en: Wielding mastery over the might of dhāraṇī and Dharma,

source: །དམ་ཚིག་བདེན་གྲུབ་དྲང་སྲོང་ཤེས་ཉེན་ཅན།
en: You, a capable ṛṣi, have genuinely mastered the samaya.

source: །ལུས་སེམས་ངག་རྣམས་བྱིན་གྱིས་རློབ་པ་དང་། །ཡིད་འོང་སྒྲས་ཀྱང་འཇིག་རྟེན་ཚིམ་པར་བྱེད།
en: Bestowing your blessing on our bodies, minds, and speech, You work to satisfy the world with your ever-pleasing voice.

source: །བྱང་ཆུབ་མཆོག་གི་སྤྱོད་ཕྱིར་སུ་དག་མོས།
en: You are admired by all for your conduct of supreme awakening.

source: །བདག་དང་གཞན་དོན་ཕུན་སུམ་ཚོགས་འགྱུར་བའི།
en: Blessed Lady, please continue always to grant the supreme purpose

source: །ལུས་དང་ངག་ཡིད་རྣམ་དག་མཆོག་འདོད་ལ།
en: To those who desire the boon of pure body, speech, and mind

source: །བཅོམ་ལྡན་འདས་མས་རྟག་ཏུ་དོན་མཆོག་སྩོལ།
en: With which to bring about the perfect benefit of beings. Help us to be brave as we strive along the path to awakening.

source: །བདག་ནི་དཔའ་ཞིང་བྱང་ཆུབ་ལམ་བརྩོན་དང་། །ལྕེ་ཡི་དབང་པོ་དག་ཅིང་ཚིག་བཙུན་ལ།
en: Let our tongues be quick and our words be righteous.

source: །རིག་པའི་གཏེར་ལྡན་སྨྲ་ལ་ཐོགས་མེད་དང་། །བདེ་གཤེགས་སྤོབས་པ་ཉེ་བར་སྒྲུབ་ཏུ་གསོལ།
en: Endow us with treasuries of knowledge and speech unobstructed. Allow us to achieve the full eloquence of all the well-gone ones.

source: །རིག་པའི་ཡུམ་གྱི་རང་བཞིན་རྟོག་ལས་དབེན།
en: Mother of knowledge, your nature is devoid of conceptuality.

source: །སྙན་པའི་རྒྱལ་མཚན་དགའ་བའི་ཤུགས་ཀྱིས་བསྐྱོད།
en: The flag of your reputation flutters in the winds of joy.

source: །མཁའ་ལ་སྣ་ཚོགས་རྣམ་པར་བྲི་འདོད་ལྟར།
en: Like wanting to draw a picture in the sky,

source: །མཚན་ཉིད་རྟོགས་དཀའ་ཡོན་ཏན་གཏིང་མཐའ་མེད།
en: Your attributes are hard to comprehend, your qualities are boundless.

source: །ན་མོ་བྷ་ག་བ་ཏེ། བྲཧྨ་ནི། ན་མཿསྭ་ར་སྭ་ཏྱཻ་དེ་བི་སིདྡྷྱནྟུ་མནྟྲ་པཱ་དཾ་བྲཧྨཱ་ནུ་མནྟྲ་སྭཱ་ཧཱ།
en: namo bhagavate brahmaṇe | namaḥ sarasvatyai devi siddhyantu mantrapādam brahmānumantra svāhā

source: དཔལ་ལྷ་མོ་སྒྲ་དབྱངས་ལ་བསྟོད་པ་རྫོགས་སོ།
en: This concludes “ In Praise of the Glorious Goddess Sarasvatī
